---
kind: enumMember
id: F:Autodesk.Revit.DB.FailureResolutionType.SkipElements
enum: Autodesk.Revit.DB.FailureResolutionType
source: html/786e6422-f66d-5320-99f9-e530819e50a1.htm
---
# Autodesk.Revit.DB.FailureResolutionType.SkipElements

Defines a resolution of a failure by skipping Element(s) for which operation has failed and proceeding
 with the rest of Elements.